# ======================= 커리큘럼, Subject, Level 정보를 구성 ====================== #
config = {
    '기차': [1,2,3,4,5,6],
    '집': [1,2,3,4,5,6],
    '악기': [1,2,3,4,5,6],
    '가전제품': [1,2,3,4,5,6],
    '공룡': [1,2,3,4,5,6],
    '곤충': [1,2,3,4,5,6],
    '바다 동물': [1,2,3,4,5,6],
    '바퀴 달린 자동차': [1,2,3,4,5,6],
    '랜드마크': [1,2,3,4,5,6],
    '동물원': [1,2,3,4,5,6],
    '직업과 알맞은 물건': [1,2,3,4,5,6],
    'New Subject':[1,2]
}

# =================================== 환경 변수 ==================================== #
LOAD_FOLDER = './model/warmstart/loader/'
LOAD_NAME = 'cremodel'

COLD_USERS_PATH = './data/cold_users.csv'
WARM_USERS_PATH = './data/warm_users.csv'

# ================================= 모델 파라미터 ================================== #
PARAMS = {
    'embed_size':64,
    'hidden_size':64,
    'learning_rate':0.001,
    'num_epochs':10,
    'batch_size':2
}

K = 10  # The number of Recommendation.
